PYTHON_STEPS/outputs/output_03_20251123_132820/0.orig/p_rgh
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;    location "0.orig";
    object p_rgh;
}

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 101325.0;

boundaryField
{
    wall_0F_1
    {
    
        type fixedFluxPressure;
    
        value $internalField;
    }
    door_0F_1
    {
    
        type fixedValue;
    
        value uniform 101325.0;
    }
    wall_0F_4
    {
    
        type fixedFluxPressure;
    
        value $internalField;
    }
    wall_0F_5
    {
    
        type fixedFluxPressure;
    
        value $internalField;
    }
    wall_0F_6
    {
    
        type fixedFluxPressure;
    
        value $internalField;
    }
    window_0F_1
    {
    
        type fixedValue;
    
        value uniform 101325.0;
    }
    floor_0F
    {
    
        type fixedFluxPressure;
    
        value $internalField;
    }
    ceil_0F
    {
    
        type fixedFluxPressure;
    
        value $internalField;
    }
}
